#+AUTHOR Hugues Balp

* ocaml source code factorization
** share common functions between ocaml programs like [1/1]
   - [X] read_json_file
* add new features [1/2]
  - [X] support for calls to _builtin functions_ like printf(), malloc() etc...
  - [ ] 
* bug corrections
** TODO debug function callers graph extraction [3/5]
   DEADLINE: <2016-01-07 jeu.>
   CLOCK: [2016-01-09 sam. 14:59]--[2016-01-09 sam. 15:06] =>  0:07
   CLOCK: [2016-01-07 jeu. 22:25]--[2016-01-07 jeu. 23:55] =>  1:30
   CLOCK: [2016-01-07 jeu. 21:57]--[2016-01-07 jeu. 22:17] =>  0:20
   CLOCK: [2016-01-07 jeu. 15:17]--[2016-01-07 jeu. 18:00] =>  2:43
   CLOCK: [2016-01-07 jeu. 13:57]--[2016-01-07 jeu. 14:41] =>  0:44
   1. [X] _naviguer depuis la déclaration des fonctions callees vers les définitions des fonctions callers et non vers leur déclaration_ [5/5]
      - pour éviter l'erreur suivante:
        extract_fcg.parse_declared_function_and_callers:WARNING: no function declared in file "/net/alpha.sc2.theresis.org/works/home/balp/third_parties/llvm/tools/clang/tools/extra/callers/tests/test_local_callgraph_several_files/dirB/B.cpp" with signature="int B::b()" !
      solution: éditer le fichier extract_fcg.ml pour:
      - [X] implémenter et appeler la méthode: _parse_defined_function_and_callers_
        au lieu de la méthode: parse_declared_function_and_callers
      - [X] implémenter la méthode _fcg.add_fct_localdecl_
        m'inspirer de la méthode fcg.add_fct_localdef
      - [X] implémenter la méthode _fcg.add_fct_extdecl_
        m'inspirer de la méthode fcg.add_fct_localdecl
      - [X] appeler depuis la fonction extract_fcg.parse_defined_function_and_callers soit: [2/2]
        - [X] la fonction add_fct_localdecl
        - [X] la fonction add_fct_extdecl
      - [X] valider l'extraction des callers avec le test_local_callgraph_several_files [3/3]
        - [X] remontée d'un cran d'une déclaration vers une définition
        - [X] remontée de deux crans d'une déclaration vers une définition puis une déclaration
        - [X] remontée jusqu'au main()
   2. [X] _naviguer depuis la définition des fonctions callers vers les déclarations des fonctions callees et non vers leur définition_
   3. [-] ajouter correctement les: [2/3]
      - [X] locallers
      - [X] extcallers
      - [ ] virtcallers
      aux déclarations de fonctions
   4. [X] remplacer les "redefinitions" par des "redeclared" dans Callers_t.fonction_decl
   5. [X] simplifier la méthode extract_fcg.parse_defined_function_and_callees:
      supprimer l'appel à self#parse_called_defined_function_and_callees
      et ne garder que l'appel à _self#parse_called_declared_function_
   6. [ ] améliorer le support des pointeurs des fonctions virtuelles
          remplacer le warning add_extcallers.ml::WARNING::incomplete caller file json file
          par un message d'info pour ignorer les méthodes virtuelles pures telles que la méthode "int A::c()" dans l'exemple de référence
** DONE other bug corrections [5/5]
   CLOCK: [2016-01-09 sam. 10:49]--[2016-01-09 sam. 13:59] =>  3:10
   1. [X] _align function callers extraction with function callees extraction_
   2. [X] debug the stack overflow problem if always present after alignment
      Je n'ai pas eu réellement besoin de deboguer ce problème après la modif précédente
      Cf in file extract_fcg.ml:
      (* WARNING: commented out because of a stack overflow problem to be resolved asap *)
      (* self#add_fct_localdef fcaller fcg_fct_def; *)
   3. [X] clean the extraction of function callees
      1. [X] remove function parse_called_declared_function
      2. [X] remove type Function_callgraph_t.fonction
   4. [X] correct function extract_fcg.callgraph_add_defined_function
   5. [X] correct function extract_fcg.callgraph_add_declared_function


